[
    {
        "image": "theroad",
        "title": "The Road",
        "author": "Cormac McCarthy",
        "pages": 287,
        "year": 2006,
        "description": "A haunting novel about a father and son's journey through a post-apocalyptic world. Their bond is tested as they navigate a barren landscape filled with threats, both human and environmental. Survival becomes their only goal, but they also search for remnants of humanity in a devastated world. McCarthy’s sparse prose and bleak imagery evoke a sense of despair, yet there is a flicker of hope in their relentless struggle.",
        "isbn": "978-0307387899",
        "edition": "1st"
    },
    {
        "image": "normalpeople",
        "title": "Normal People",
        "author": "Sally Rooney",
        "pages": 273,
        "year": 2018,
        "description": "A nuanced exploration of friendship, love, and personal identity. The novel follows Connell and Marianne, whose complex relationship evolves from high school to university. Through their interactions, Rooney examines the subtleties of social class, intimacy, and emotional dependency. The story is a modern reflection on how people change, grow, and impact each other over time, set against the backdrop of contemporary Ireland.",
        "isbn": "978-0571334650",
        "edition": "2nd"
    },
    {
        "image": "theundergroundrailroad",
        "title": "The Underground Railroad",
        "author": "Colson Whitehead",
        "pages": 320,
        "year": 2016,
        "description": "A powerful reimagining of the historical Underground Railroad as an actual railway. The novel follows Cora, a young slave who embarks on a perilous journey for freedom. Whitehead’s inventive narrative blends history with speculative elements, highlighting the brutal realities of slavery. The story is both a meditation on the enduring impact of American slavery and a testament to the resilience of those who sought freedom against impossible odds.",
        "isbn": "978-0385542364",
        "edition": "1st"
    },
    {
        "image": "thenightcircus",
        "title": "The Night Circus",
        "author": "Erin Morgenstern",
        "pages": 387,
        "year": 2011,
        "description": "A fantastical love story set within a mysterious, magical circus. The narrative unfolds in a dreamlike world where two young illusionists are bound by a competition they must win to survive. The circus itself becomes a character, enchanting readers with its dark wonders and secrets. Morgenstern’s lush prose and richly imagined settings create a mesmerizing atmosphere that lingers long after the final page is turned.",
        "isbn": "978-0307744432",
        "edition": "3rd"
    },
    {
        "image": "tokillamockingbird",
        "title": "To Kill a Mockingbird",
        "author": "Harper Lee",
        "pages": 281,
        "year": 1960,
        "description": "A seminal work on racial injustice in the American South, told through the eyes of a young girl named Scout Finch. Her father, Atticus Finch, serves as a moral hero as he defends a black man falsely accused of rape. The novel explores themes of prejudice, morality, and the loss of innocence. Lee’s narrative remains a timeless reflection on human conscience and the fight against systemic racism.",
        "isbn": "978-0061120084",
        "edition": "5th"
    },
    {
        "image": "1984",
        "title": "1984",
        "author": "George Orwell",
        "pages": 328,
        "year": 1949,
        "description": "A dystopian novel exploring themes of totalitarianism, surveillance, and individualism. Orwell introduces readers to a world where the government, led by Big Brother, exerts total control over reality itself. The protagonist, Winston Smith, battles against the oppressive regime’s psychological manipulation. Orwell’s chilling depiction of a world without freedom serves as a stark warning against the dangers of unchecked political power.",
        "isbn": "978-0451524935",
        "edition": "1st"
    },
    {
        "image": "thecatcherintherye",
        "title": "The Catcher in the Rye",
        "author": "J.D. Salinger",
        "pages": 277,
        "year": 1951,
        "description": "A story about teenage rebellion and identity, narrated by the iconic Holden Caulfield. As he navigates the complexities of adolescence, Holden critiques the phoniness of the adult world around him. His inner turmoil reflects broader themes of alienation, mental health, and the struggle for authenticity. Salinger’s novel remains a touchstone for those grappling with the existential angst of growing up.",
        "isbn": "978-0316769488",
        "edition": "10th"
    },
    {
        "image": "prideandprejudice",
        "title": "Pride and Prejudice",
        "author": "Jane Austen",
        "pages": 279,
        "year": 1813,
        "description": "A classic romantic novel that critiques the British landed gentry of the early 19th century. The story revolves around Elizabeth Bennet and Mr. Darcy, whose initial misunderstandings evolve into mutual understanding and love. Austen's sharp wit and keen observations of society reveal the complexities of marriage, morality, and class. The novel remains beloved for its charming characters and timeless exploration of human relationships.",
        "isbn": "978-1503290563",
        "edition": "4th"
    },
    {
        "image": "thegreatgatsby",
        "title": "The Great Gatsby",
        "author": "F. Scott Fitzgerald",
        "pages": 180,
        "year": 1925,
        "description": "A tragic story of love and ambition set in the Jazz Age of 1920s America. Jay Gatsby's pursuit of wealth and status is driven by his unrelenting love for Daisy Buchanan. Through Gatsby's rise and fall, Fitzgerald critiques the American Dream and the moral decay beneath the surface of opulence. The novel's vivid portrayal of decadence and disillusionment continues to resonate with readers today.",
        "isbn": "978-0743273565",
        "edition": "2nd"
    },
    {
        "image": "beloved",
        "title": "Beloved",
        "author": "Toni Morrison",
        "pages": 324,
        "year": 1987,
        "description": "A haunting tale of slavery, loss, and the struggle for freedom. Sethe, a former enslaved woman, is haunted by the ghost of her deceased daughter, Beloved. Morrison’s narrative blends the supernatural with stark realism, exploring the psychological scars left by slavery. The novel delves deep into themes of memory, trauma, and the unrelenting search for identity amidst a history of pain and suffering.",
        "isbn": "978-1400033416",
        "edition": "1st"
    },
    {
        "image": "bravenewworld",
        "title": "Brave New World",
        "author": "Aldous Huxley",
        "pages": 311,
        "year": 1932,
        "description": "A dystopian vision of a future society driven by technological control and the loss of individuality. Citizens live in a highly stratified, consumerist society where emotions and desires are regulated by the state. Through characters like Bernard Marx and John the Savage, Huxley critiques a world where freedom is sacrificed for comfort. The novel remains a powerful cautionary tale about the perils of losing humanity to technological advancement.",
        "isbn": "978-0060850524",
        "edition": "8th"
    },
    {
        "image": "mobydick",
        "title": "Moby-Dick",
        "author": "Herman Melville",
        "pages": 635,
        "year": 1851,
        "description": "An epic tale of obsession and revenge between Captain Ahab and the great white whale, Moby Dick. The novel explores complex themes such as fate, free will, and the human condition. Ishmael’s narrative is a rich tapestry of philosophy, marine biology, and adventure. Melville’s masterful storytelling has made this a cornerstone of American literature, delving into the darker depths of the human psyche.",
        "isbn": "978-1503280786",
        "edition": "3rd"
    },
    {
        "image": "warandpeace",
        "title": "War and Peace",
        "author": "Leo Tolstoy",
        "pages": 1225,
        "year": 1869,
        "description": "A grand narrative that intertwines the lives of several families during the Napoleonic Wars. Tolstoy’s epic spans love, war, history, and philosophy, providing a panoramic view of Russian society. Through characters like Pierre, Natasha, and Andrei, Tolstoy examines the human experience in times of turmoil and peace. The novel’s rich detail and profound insight have made it a monumental achievement in world literature.",
        "isbn": "978-1400079988",
        "edition": "6th"
    },
    {
        "image": "thehobbit",
        "title": "The Hobbit",
        "author": "J.R.R. Tolkien",
        "pages": 310,
        "year": 1937,
        "description": "A fantastical adventure of a hobbit's journey to reclaim a lost kingdom from a dragon. Bilbo Baggins, an unlikely hero, encounters trolls, elves, and the enigmatic Gollum along his quest. Tolkien’s narrative combines humor, suspense, and moral lessons, setting the stage for his later works in Middle-earth. The story is celebrated for its imaginative world-building and timeless themes of courage and friendship.",
        "isbn": "978-0547928227",
        "edition": "7th"
    },
    {
        "image": "thealchemist",
        "title": "The Alchemist",
        "author": "Paulo Coelho",
        "pages": 208,
        "year": 1988,
        "description": "A philosophical tale about following one's dreams and discovering personal legend. Santiago, a shepherd boy, embarks on a journey across the desert in search of treasure, only to find it within. Coelho’s novel is a reflection on the importance of self-discovery, fate, and perseverance. Its allegorical nature has inspired readers worldwide to listen to their hearts and pursue their own paths.",
        "isbn": "978-0062315007",
        "edition": "2nd"
    },
    {
        "image": "slaughterhousefive",
        "title": "Slaughterhouse-Five",
        "author": "Kurt Vonnegut",
        "pages": 275,
        "year": 1969,
        "description": "A satirical novel that blends war, time travel, and existential reflection. The story follows Billy Pilgrim, who becomes unstuck in time after surviving the firebombing of Dresden. Vonnegut’s dark humor and nonlinear narrative style challenge conventional storytelling, offering a unique perspective on war and human nature. The novel remains a cornerstone of anti-war literature and postmodern fiction.",
        "isbn": "978-0385333849",
        "edition": "5th"
    },
    {
        "image": "thehandmaidstale",
        "title": "The Handmaid's Tale",
        "author": "Margaret Atwood",
        "pages": 311,
        "year": 1985,
        "description": "A dystopian novel about a theocratic society where women are subjugated and used for reproduction. Through the eyes of Offred, a handmaid, Atwood explores themes of power, control, and resistance. The narrative is both a critique of patriarchal structures and a cautionary tale about the loss of rights. Its chilling portrayal of a dystopia grounded in real-world issues has made it a contemporary classic.",
        "isbn": "978-0385490818",
        "edition": "4th"
    },
    {
        "image": "thegrapesofwrath",
        "title": "The Grapes of Wrath",
        "author": "John Steinbeck",
        "pages": 464,
        "year": 1939,
        "description": "A powerful story of the Joad family's migration during the Great Depression. As they journey from Oklahoma to California, they face hardship, exploitation, and the search for dignity. Steinbeck’s narrative captures the plight of the disenfranchised and critiques the social and economic inequalities of the time. The novel’s stark realism and compassion have solidified its place in American literature.",
        "isbn": "978-0143039433",
        "edition": "6th"
    },
    {
        "image": "janeeyre",
        "title": "Jane Eyre",
        "author": "Charlotte Brontë",
        "pages": 500,
        "year": 1847,
        "description": "A classic novel about the life and struggles of an orphaned girl who becomes a governess. Jane Eyre's journey is marked by a quest for love, independence, and self-respect. Her relationship with the enigmatic Mr. Rochester is fraught with secrets and moral dilemmas. Brontë’s exploration of class, gender, and personal integrity has made this novel a timeless exploration of human spirit and resilience.",
        "isbn": "978-0141441146",
        "edition": "9th"
    },
    {
        "image": "thepictureofdoriangray",
        "title": "The Picture of Dorian Gray",
        "author": "Oscar Wilde",
        "pages": 254,
        "year": 1890,
        "description": "A novel exploring themes of vanity, moral corruption, and the consequences of a life of excess. Dorian Gray, a young man who never ages, becomes increasingly morally bankrupt as he pursues hedonistic pleasures. Wilde’s wit and critique of societal norms shine through his exploration of the duality of human nature. The novel remains a compelling commentary on the cost of living a life devoid of virtue.",
        "isbn": "978-0141439570",
        "edition": "2nd"
    }
]